/*
 * Розгалуження if
Розгалуження використовуються для виконання різноманітного коду,
 залежно від умови. Принцип роботи простий - результат умови
  приводиться до буля true або false, після чого потік програми
   спрямовується в ту або іншу гілку.
 */

// =============== Інструкція if ===================

// if (умова) {
// тіло if
// }

// let cost = 0;
// const subscription = "sro";

// if (subscription === "pro") {
//   cost = 100;
// }

// console.log(cost); // 100

// =============== Інструкція if...else ===================

// if (умова) {
//   // тіло if
// } else {
//   // тіло else
// }

// let cost;
// const subscription = "free";

// if (subscription === "pro") {
//   cost = 100;
// } else {
//   cost = 0;
// }

// console.log(cost); // 0

// =============== Інструкція  else...if ===================

// if (умова) {
//   // тіло if
// } else if (умова) {
//   // тіло else if
// }

// let cost = null;
// const subscription = "";

// if (subscription === "free") {
//   cost = 0;
// } else if (subscription === "pro") {
//   cost = 100;
// } else if (subscription === "premium") {
//   cost = 500;
// } else {
//   console.log("Invalid subscription type");
// }

// console.log(cost); // 500

// ================================example===========================================
/*
? Дано рядок, що складається із символів, наприклад, 'abcde'.
? Перевірте, що першим символом цього рядка є буква 'a'.
? Якщо це так - виведіть 'так', інакше виведіть 'ні'.
*/

// const str = "abcde";
// if (str.startsWith("a")) {
//   console.log("Так!");
// } else {
//   console.log("Ні!");
// }

/*
? Запросіть у користувача число, якщо число дорівнює 10,
? то виведіть 'Вірно', інакше виведіть 'Невірно'.
*/

// const userAnsw = Number(prompt("введіть число"));

// if (userAnsw === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

/*
? У змінній min лежить число від 0 до 59.
? Визначте, в яку чверть години потрапляє це число (у першу, другу, третю чи четверту).
? [0 до 15) - перша чверть години
? [15 до 30) - друга чверть години
? [30 до 45) - третя чверть години
? [45 до 60) - четверта чверть години
*/

/*
? Напишіть код, який запитуватиме:
? 'Яка «офіційна» назва JavaScript?'
? Якщо користувач вводить ECMAScript,
? то показати: «Вірно!», інакше – відобразити: «Не знаєте? ECMAScript!»
*/
