/*
 * Тернарний оператор
 */
// Тернарний оператор використовується у якості синтаксично коротшої
// заміни інструкції if...else, коли одній і тій самій змінній необхідно
//  присвоїти різні значення за умовою.

// <умова> ? <вираз_якщо_умова_правдива> : <вираз_якщо_умова_хибна>

//Може присвоюватись змінній

/* Працює за наступною схемою:

 Обчислюється умова.
 Якщо умова правдива, тобто приводиться до true, обчислюється вираз після ?.
Якщо умова хибна, тобто приводиться до false, обчислюється вираз після :.
 Значення обчисленого виразу повертається у якості результату роботи тернарного оператора.*/

// ===============================example=============================================

/*
? Перепишіть конструкцію if з використанням умовного оператора '?':
*/
// const a = 2;
// const b = 1;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Багато';
// }

// console.log(a + b < 4 ? "Мало" : "Багато");

// const login = "wearstgdg";
// let message;

// const message =
//   login === "Співробітник"
//     ? "Привіт"
//     : login === "Директор"
//     ? "Вітаю"
//     : login === ""
//     ? "Немає логіну"
//     : "я вас не знаю";

// if (login === "Співробітник") {
//   message = "Привіт";
// } else if (login === "Директор") {
//   message = "Вітаю";
// } else if (login === "") {
//   message = "Немає логіну";
// } else {
//   message = "";
// }
// console.log(message);

/*
?  Перепишіть if..else за допомогою декількох операторів '?'.
*/
// const login = "";
// let message = "";

// if (login === 'Співробітник') {
//   message = 'Привіт';
// } else if (login === 'Директор') {
//   message = 'Вітаю';
// } else if (login === '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }

// console.log(message);

// ===========================================================================

//?   Використовуючи конструкцію if..else та prompt,
//?   напиши код, який питатиме: "Яка офіційна назва JavaScript?".
//?   Якщо користувач вводить ECMAScript, то показуй alert з рядком "Правильно!",
//?   в іншому випадку - "Не знаєте? ECMAScript!"
// ==================================================================================
//? Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка
//? формату "14 г. 26 хв.".Якщо значення змінної minutes дорівнює 0, то виводь рядок "14 г.",
//?   без хвилин.

// const hour = 14;
// const minutes = 10;

// if (minutes !== 0) {
//   console.log(`${hour} г. ${minutes} хв.`);
// } else {
//   console.log(`${hour} г.`);
// }

// ==================================================================================
//? Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо у prompt користувач ввів число більше нуля.
//?  Якщо було введено нуль, виводь в консоль рядок "Це нуль".Якщо передали від'ємне число,
//?   у консолі повинен бути рядок "Це негативне число".

// const userInput = prompt("Введіть число");
// =================================================================================
