// // Що буде консолі?
// let fruits = ["Apples", "Pear", "Orange"];

// let shoppingCart = fruits;
// shoppingCart.push("Banana");

// console.log(fruits.length); // ?

// // ================================================
// // Яким буде результат? Чому?

// let arr = ["a", "b"];

// arr.push(function () {
//   console.log(this);
// });

// arr[2](); // ?

// ====================================================

// Напишіть функцію sumInput() яка:

// Просить користувача ввести дані за допомогою prompt та зберігає їх в масив.
// Закінчує робити запити в користувача після того, як введено не числове значення, порожня строка або натиснуто “відмінити”.
// Підраховує та повертає суму елементів масиву.
// P.S. Нуль 0 це – валідне число, будь ласка, не зупиняйте функцію при введені 0.

// ====================================================

// Колбек-функція
// function greet(name) {
//   console.log(`Ласкаво просимо ${name}.`);
// }

const greet = () => console.log(`Ласкаво просимо ${name}.`);

() => {};

// Функція вищого порядку
function registerGuest(name, callback) {
  console.log(`Реєструємо гостя ${name}.`);
  callback(name);
}

registerGuest("Манго", greet);

// Передаємо інлайн функцію greet у якості колбека
registerGuest("Манго", function greet(name) {
  console.log(`Ласкаво просимо ${name}.`);
});
