// #Функції

//$ Оголошення функції (Function Declaration)
//$ Параметри та аргументи
//$ Повернення значення
//$ Порядок виконання коду
//$ Параметри за замовчуванням
//$ Псевдомасив arguments
//$ Перетворення псевдомасиву
//$ Патерн «Раннє повернення»
//$ Функціональний вираз (Function Expression)

//$* ========================Оголошення функції(Function Declaration)==========
// function назва_функції(параметр_1, параметр_2...) {
// тіло функції
// }
//$** =======================Параметри та аргументи============================
//$* ========================Повернення значення===============================
//$* ========================Порядок виконання коду============================
//$* ========================Параметри за замовчуванням========================
//$* ========================Псевдомасив arguments=============================
//$* ========================Перетворення псевдомасиву=========================
//$* ========================Патерн «Раннє повернення»=========================
//$* ========================Функціональний вираз (function expression)========
// Синтаксис, що ми раніше використовували, називається Оголошення Функції (Function Declaration):

// function sayHi() {
//   alert( "Привіт" );
// }

// Існує й інший синтаксис для створення функції, що називають Функціональним Виразом (Function Expression).
// Він дозволяє створювати функцію всередині будь-якого виразу.
// Наприклад:

// const sayHi = function() {
//   alert( "Привіт" );
// };
